perf/blitzkrieg.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    # Arrival of 300 New VUs per second for 60 seconds
    - name: BigLoad
      duration: 30
      arrivalRate: 300
    # - name: FirstPause
    #   pause: 30
    - name: BiggerLoast
      duration: 60
      arrivalRate: 1000
    # - name: SecondPause
    #   pause: 15
    - name: BiggestLoad
      duration: 60
      arrivalRate: 2000

scenarios:
  - name: Blitzkrieg (/)
    flow:
      - get:
          url: '/bbox1'