perf/concurrencyTest.yaml
config:
  http:
    # Responses have to be sent within 10 seconds, or an `ETIMEDOUT` error gets raised.
    timeout: 1000
  environments:
    node:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    # Arrival of 10 New VUs per second for 60 seconds
    - name: Clean
      duration: 10
      arrivalRate: 0
    # Arrival of 10 New VUs per second for 60 seconds
    - name: WarmUp
      duration: 40
      arrivalRate: 1
    # Arrival of 300 New VUs per second for 60 seconds
    - name: TwoJobs
      duration: 40
      arrivalRate: 2
  # Arrival of 300 New VUs per second for 60 seconds
    - name: ThreeJobs
      duration: 40
      arrivalRate: 3
  # Arrival of 300 New VUs per second for 60 seconds
    - name: TenJobs
      duration: 40
      arrivalRate: 4
  # Arrival of 300 New VUs per second for 60 seconds
    - name: TenJobs
      duration: 40
      arrivalRate: 6
  # Arrival of 300 New VUs per second for 60 seconds
    - name: TenJobs
      duration: 40
      arrivalRate: 8
  # Arrival of 300 New VUs per second for 60 seconds
    - name: TenJobs
      duration: 40
      arrivalRate: 10
  # Arrival of 300 New VUs per second for 60 seconds
    - name: CleanAgain
      duration: 40
      arrivalRate: 0

scenarios:
  - name: bbox1 (/)
    flow:
      - get:
          url: '/bbox1'
#   - name: bbox2 (/)
#     flow:
#       - get:
#           url: '/bbox2'