perf/heavy.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
      http:
        timeout: 1024


  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Clean
      duration: 60
      arrivalRate: 0
    - name: Ramp
      duration: 30
      arrivalRate: 5
      rampTo: 60
    - name: Plain
      duration: 60
      arrivalRate: 60
    

scenarios:
  - name: bbox2 (/)
    flow:
      - get:
          url: '/bbox2'