perf/load-testing.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
      http:
        timeout: 1024

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    # Ramp-up phase from 10 new VUs per second to 300 per second for 60 seconds
    - name: FirstRampUp
      duration: 30
      arrivalRate: 1
      rampTo: 3
    - name: Constant
      duration: 30
      arrivalRate: 3
    # Arrival of 300 New VUs per second for 60 seconds
    - name: SecondRampUp
      duration: 60
      arrivalRate: 3
      rampTo: 15

scenarios:
  # - name: bbox1 (/)
  #   flow:
  #     - get:
  #         url: '/bbox1'
  # # - name: bbox2 (/)
  #   flow:
  #     - get:
  #         url: '/bbox2'
    - name: heavy (/)
      flow:
        - get:
            url: '/heavy'